### Индививидуальное завдание:

Определите самое распространённое женское имя среди пассажиров Титаника. Извлеките из полного имени пассажира (колонка Name) его личное имя. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

**Алсо завдание от порутчика:**

Помочь порутчику Ржевскому не попасть в просак, выделив статистику по именам замужних и свободных барышень

Импортируем Pandas

In [95]:
import pandas as pd

Загрузим датасет титаника

In [96]:
data = pd.read_csv('titanic.csv')

Посмотрим шо там есть, шоб продумать как отфильтровать список телок

In [97]:
data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

Видим, на корабле определенно есть тееелки! Естесственно благородные мужи не поехали бы без телок! Шифруются телки как:
* Mrs - замужние (не интересный вариант, но муж не стенка, подвинется)
* Miss - уаще огонь, двигать никого не надо. Либо сильные и независимые, либо легкой натуры

Первоначало сделаем выборку по полу

In [98]:
telki = data.loc[data["Sex"] == "female", "Name"]
telki

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
                             ...
880         Shelley, Mrs. William (Imanita Parrish Hall)
882                         Dahlberg, Miss. Gerda Ulrika
885                 Rice, Mrs. William (Margaret Norton)
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
Name: Name, Length: 314, dtype: object

Определенно далее даже сам порутчик Ржевский позавидовал бы нашему знанию регулярных выражений, для фильтрации телок

In [99]:
telki = telki.str.extract(r"Mrs\..*?\((\w+) | Miss\. *(\w+)", expand=True)
telki

             0          1
1     Florence        NaN
2          NaN      Laina
3         Lily        NaN
8    Elisabeth        NaN
9        Adele        NaN
..         ...        ...
880    Imanita        NaN
882        NaN      Gerda
885   Margaret        NaN
887        NaN   Margaret
888        NaN  Catherine

[314 rows x 2 columns]

Итого имеем: 
* несколько опасные варианты: в случае чего может прилететь по бобику от хахаля (ну если он не олень, конечно)

In [100]:
mamki_chuzhiye_zheny = telki[0].dropna().value_counts()
mamki_chuzhiye_zheny

Elizabeth    6
Anna         5
Maria        4
Ada          4
Margaret     4
            ..
Bessie       1
Myna         1
Ethel        1
Selma        1
Madeleine    1
Name: 0, Length: 74, dtype: int64

* почти безопасные варианты (правда есть одно **но**: мы забыли отфильтровать по возрасту, но порутчику данная информация ни к чему, он одобряэ)

In [101]:
norm_telki = telki[1].dropna().value_counts()
norm_telki

Anna         9
Mary         9
Margaret     6
Elizabeth    5
Helen        4
            ..
Nora         1
Brigdet      1
Edwina       1
Roberta      1
Doolina      1
Name: 1, Length: 120, dtype: int64